app/controllers/notes_controller.rb

SELECT * FROM "notes"
---
  def index
    @notes = Note.all

SELECT * FROM "notes" WHERE ("notes"."id" = 1)
---
  def show
    @note = Note.find(params[:id])

SELECT * FROM "notes" WHERE ("notes"."id" = 1)
---
  def edit
    @note = Note.find(params[:id])

INSERT INTO "notes" ("updated_at", "note", "created_at") VALUES('2009-05-01 07:31:37', 'what about ips?', '2009-05-01 07:31:37')
---
  def create
    @note = Note.new(params[:note])

    respond_to do |format|
      if @note.save

SELECT * FROM "notes" WHERE ("notes"."id" = 1)
UPDATE "notes" SET "note" = 'what about ips!?', "updated_at" = '2009-05-01 07:33:55' WHERE "id" = 1
---
  def update
    @note = Note.find(params[:id])

    respond_to do |format|
      if @note.update_attributes(params[:note])

SELECT * FROM "notes" WHERE ("notes"."id" = 1)
DELETE FROM "notes" WHERE "id" = 1
---
  def destroy
    @note = Note.find(params[:id])
    @note.destroy